In [4]:
## 비행 시간 평균 비행 시간 2시간
## 출발 시간 실제 출발시간
## 도착 시간 실제 도착시간
## '1000' '1300'


def air_line(start_time,arrival_time,flight_time):
    start_hour = int(start_time[0:2])
    start_min = int(start_time[2:])
    start = start_hour*60+start_min
    arrival_hour = int(arrival_time[0:2])
    arrival_min = int(arrival_time[2:])
    arrival = arrival_hour*60 + arrival_min
    elap = (arrival - start)
    delay = elap - int(flight_time)*60
    return delay

In [7]:
air_line('1000','1320','1')

140

In [12]:
dt = {'start_time':'1000','arrival_time':'1230','flight_time':'1'}

In [16]:
air_line(**dt)

90

In [157]:
## 2. data titanic2에 넣기

import numpy as np
import pandas as pd
import cx_Oracle
from sqlalchemy import create_engine, text
df_titanic=pd.read_csv('https://gist.githubusercontent.com/DariaAlekseeva/299611a0daa6008685f7/raw/b431eb200bcafd2eba68a11ccbc80d051d3eeba9/titanic.csv')

In [158]:
df_titanic['Cabin'].fillna('',inplace=True)
df_titanic['Fare'].fillna('',inplace=True)
df_titanic['Embarked'].fillna('',inplace=True) # nan없애기

In [159]:
engine=create_engine('oracle://c##big:123@localhost:1521/orcl')

In [160]:
stmt='''insert into titanic2(PassengerId,Passengers,Class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked) \
values(:PassengerId,:Passengers,:Class,:Name,:Sex,:Age,:SibSp,:Parch,:Ticket,:Fare,:Cabin,:Embarked)'''

In [161]:
stmt=text(stmt)

In [162]:
df_titanic=df_titanic.astype('object')

In [163]:
for i in range(len(df_titanic)):
    dt=df_titanic.iloc[i,:].to_dict()
    engine.execute(stmt,**dt)  
## titanic2에다가 넣는것

In [164]:
df = pd.read_sql_query('select * from titanic2 order by passengerid',con=engine)

# titanic2에 있는 값을 읽어온다음 df의 저장

In [165]:
df

,passengerid,passengers,class,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1.0,Perished,3.0,"Braund, Mr. Owen Harris",male,19 - 40,1.0,0.0,A/5 21171,7.2500,None,S
1,2.0,Survived,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,19 - 40,1.0,0.0,PC 17599,71.2833,C85,C
2,3.0,Survived,3.0,"Heikkinen, Miss. Laina",female,19 - 40,0.0,0.0,STON/O2. 3101282,7.9250,None,S
3,4.0,Survived,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,19 - 40,1.0,0.0,113803,53.1000,C123,S
4,5.0,Perished,3.0,"Allen, Mr. William Henry",male,19 - 40,0.0,0.0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...
1041,1301.0,Survived,3.0,"Peacock, Miss. Treasteall",female,Under 18,1.0,1.0,SOTON/O.Q. 3101315,13.7750,None,S
1042,1303.0,Survived,1.0,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,19 - 40,1.0,0.0,19928,90.0000,C78,Q
1043,1304.0,Survived,3.0,"Henriksson, Miss. Jenny Lovisa",female,19 - 40,0.0,0.0,347086,7.7750,None,S
1044,1306.0,Survived,1.0,"Oliva y Ocana, Dona. Fermina",female,19 - 40,0.0,0.0,PC 17758,108.9000,C105,C
1045,1307.0,Perished,3.0,"Saether, Mr. Simon Sivertsen",male,19 - 40,0.0,0.0,SOTON/O.Q. 3101262,7.2500,None,S